OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
    size_t contentLength = request->contentLength();
    DBUGVAR(contentLength);
    if(contentLength > 0)
    {
      int percent = index / (contentLength / 100);
      DBUGVAR(percent);
      DBUGVAR(lastPercent);
      if(percent != lastPercent) {
        String text = String(percent) + F("%");
        lcd_display(text, 0, 1, 10 * 1000, LCD_DISPLAY_NOW);
        DEBUG_PORT.printf("Update: %d%%\n", percent);
        lastPercent = percent;
      }
    }
    if(Update.write(data, len) != len) {
      handleUpdateError(request);
    }
  }

  if(MG_EV_HTTP_PART_END == ev)
  {
    DBUGLN("Upload finished");
    if(Update.end(true)) {
      DBUGF("Update Success: %lluB", index+len);
      lcd_display(F("Complete"), 0, 1, 10 * 1000, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
      upgradeResponse->setCode(200);
      upgradeResponse->print("OK");
      request->send(upgradeResponse);
      upgradeResponse = NULL;
    } else {
      DBUGF("Update failed: %d", Update.getError());
      lcd_display(F("Error"), 0, 1, 10 * 1000, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
      handleUpdateError(request);
    }
  }

  return len;
}

static void handleUpdateClose(MongooseHttpServerRequest *request)
{
  DBUGLN("Update close");

  if(upgradeResponse) {
    delete upgradeResponse;
    upgradeResponse = NULL;
  }

  if (Update.isFinished() && !Update.hasError())
  {
    systemRebootTime = millis() + 1000;
  }
}

// -------------------------------------------------------------------
// Update Controller firmware
// url: /updateController
// -------------------------------------------------------------------
void handleUpdateControllerGet(MongooseHttpServerRequest *request)
{
  MongooseHttpServerResponseStream *response;
  if (false == requestPreProcess(request, response, CONTENT_TYPE_HTML))
  {
    return;
  }

  response->setCode(200);
  response->print(
      F("<html><form method='POST' action='/updateController' enctype='multipart/form-data'>"
        "<input type='file' name='firmware'> "
        "<input type='submit' value='Update'>"
        "</form></html>"));
  request->send(response);
}

static MongooseHttpServerResponseStream *upgradeResponseController = NULL;

void handleUpdateControllerPost(MongooseHttpServerRequest *request)
{
  if (NULL != upgradeResponseController)
  {
    request->send(500, CONTENT_TYPE_TEXT, "Error: Upgrade in progress");
    return;
  }

  if (false == requestPreProcess(request, upgradeResponseController, CONTENT_TYPE_TEXT))
  {
    return;
  }

  // TODO: Add support for returning 100: Continue
}

static int lastPercentController = -1;

static void handleUpdateControllerError(MongooseHttpServerRequest *request)
{
  upgradeResponseController->setCode(500);
  upgradeResponseController->printf("Error: %d", Update.getError());
  request->send(upgradeResponseController);
  upgradeResponseController = NULL;

  // Anoyingly this uses Stream rather than Print...
#ifdef ENABLE_DEBUG
  UpdateController.printError(DEBUG_PORT);
#endif
}

size_t
handleUpdateControllerUpload(MongooseHttpServerRequest *request, int ev, MongooseString filename, uint64_t index, uint8_t *data, size_t len)
{
  if (MG_EV_HTTP_PART_BEGIN == ev)
  {
    //    dumpRequest(request);

    DEBUG_PORT.printf("Update Start: %s\n", filename.c_str());

    lcd_display(F("Updating Controller"), 0, 0, 0, LCD_CLEAR_LINE);
    lcd_display(F(""), 0, 1, 10 * 1000, LCD_CLEAR_LINE);
    lcd_loop();

    if (!UpdateController.begin())
    {
      handleUpdateControllerError(request);
    }
  }

  if (!UpdateController.hasError())
  {
    DBUGF("Update Writing %llu", index);

    size_t contentLength = request->contentLength();
    DBUGVAR(contentLength);
    if (contentLength > 0)
    {
      int percent = index / (contentLength / 100);
      DBUGVAR(percent);
      DBUGVAR(lastPercentController);
      if (percent != lastPercentController)
      {
        String text = String(percent) + F("%");
        lcd_display(text, 0, 1, 10 * 1000, LCD_DISPLAY_NOW);
        DEBUG_PORT.printf("Update: %d%%\n", percent);
        lastPercentController = percent;
      }
    }
    if (UpdateController.write(data, len) != len)
    {
      handleUpdateControllerError(request);
    }
  }

  if (MG_EV_HTTP_PART_END == ev)
  {
    DBUGLN("Upload finished");
    if (UpdateController.end(true))
    {
      DBUGF("Update Success: %lluB", index + len);
      lcd_display(F("Complete"), 0, 1, 10 * 1000, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
      upgradeResponseController->setCode(200);
      upgradeResponseController->print("OK");
      request->send(upgradeResponseController);
      upgradeResponseController = NULL;
    }
    else
    {
      DBUGF("Update failed: %d", UpdateController.getError());
      lcd_display(F("Error"), 0, 1, 10 * 1000, LCD_CLEAR_LINE | LCD_DISPLAY_NOW);
      handleUpdateControllerError(request);
    }
  }

  return len;
}

static void handleUpdateControllerClose(MongooseHttpServerRequest *request)
{
  DBUGLN("Update close");

  if (upgradeResponseController)
  {
    delete upgradeResponseController;
    upgradeResponseController = NULL;
  }

  if (UpdateController.isFinished() && !UpdateController.hasError())
  {
    systemRebootTime = millis() + 1000;
  }
}

String delayTimer = "0 0 0 0";

void
handleRapi(MongooseHttpServerRequest *request) {
  bool json = isPositive(request, "json");

  int code = 200;

  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, json ? CONTENT_TYPE_JSON : CONTENT_TYPE_HTML)) {
    return;
  }

  String s;

  if(false == json) {
    s = F("<html><font size='20'><font color=006666>Open</font><b>EVSE</b></font><p>"
          "<b>Open Source Hardware</b><p>RAPI Command Sent<p>Common Commands:<p>"
          "Set Current - $SC XX<p>Set Service Level - $SL 1 - $SL 2 - $SL A<p>"
          "Get Real-time Current - $GG<p>Get Temperatures - $GP<p>"
          "<p>"
          "<form method='get' action='r'><label><b><i>RAPI Command:</b></i></label>"
          "<input id='rapi' name='rapi' length=32><p><input type='submit'></form>");
  }

  if (request->hasParam("rapi"))
  {
    String rapi = request->getParam("rapi");

    // BUG: Really we should do this in the main loop not here...
    RAPI_PORT.flush();
    DBUGVAR(rapi);
    int ret = rapiSender.sendCmdSync(rapi);
    DBUGVAR(ret);

    if(RAPI_RESPONSE_OK == ret ||
       RAPI_RESPONSE_NK == ret)
    {
      String rapiString = rapiSender.getResponse();

      // Fake $GD if not supported by firmware
      if(RAPI_RESPONSE_OK == ret && rapi.startsWith(F("$ST"))) {
        delayTimer = rapi.substring(4);
      }
      if(RAPI_RESPONSE_NK == ret)
      {
        if(rapi.equals(F("$GD"))) {
          ret = 0;
          rapiString = F("$OK ");
          rapiString += delayTimer;
        }
        else if (rapi.startsWith(F("$FF")))
        {
          DBUGF("Attempting legacy FF support");

